tutorials/compressible/sonicLiquidFoam/decompressionTank/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outerWall
    {
        type            wall;
        nFaces          225;
        startFace       7275;
    }
    axis
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          120;
        startFace       7500;
    }
    nozzle
    {
        type            patch;
        nFaces          5;
        startFace       7620;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3725;
        startFace       7625;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3725;
        startFace       11350;
    }
)

// ************************************************************************* //
